# CLI - cross-platform (macOS and Linux)
brew "bat"
brew "coreutils"
brew "eza" # Modern, maintained replacement for ls
brew "fzf"
brew "git"
brew "git-lfs"
brew "node"
brew "poetry"
brew "pre-commit"
brew "ranger" # r to navigate the file system
brew "ripgrep"
brew "speedtest-cli"
brew "starship" # Zsh theme
brew "tldr"
brew "tree" # Adds the 'tree' cli command
brew "vim"
brew "difftastic" # Defaulting for git diff
brew "zoxide" # Better cd

# Neovim + LazyVim setup
brew "neovim"
brew "tree-sitter-cli" # Required for lazyvim
brew "fd" # Alternative to find in CLI
brew "lazygit" # Git UI
brew "luarocks"
